app/Controllers/Products.php

    public function index()
    {
        $model = new ProductModel();
        $data = $model->findAll();
---
SELECT *
FROM `product`

    public function show($id = null)
    {
        $model = new ProductModel();
        $data = $model->getWhere(['product_id' => $id])->getResult();
---
SELECT *
FROM `product`
WHERE `product_id` = '2'

    public function create()
    {
        $model = new ProductModel();
        $data = [
            'product_name' => $this->request->getPost('product_name'),
            'product_price' => $this->request->getPost('product_price')
        ];
        $model->insert($data);
---
INSERT INTO `product` (`product_name`, `product_price`) VALUES ('Product 8', '123000')

    public function delete($id = null)
    {
        $model = new ProductModel();
        $data = $model->find($id);
        if($data) {
            $model->delete($id);
---
SELECT *
FROM `product`
WHERE `product`.`product_id` = '5'
DELETE FROM `product`
WHERE `product_id` IN ('5')